# AddReferenceCurve Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeType..::..AddReferenceCurve Method
DirectShapeType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddReferenceCurve(Curve) | Adds a reference curve to the DirectShapeType. |
| AddReferenceCurve(Curve, DirectShapeReferenceOptions) | Adds a reference curve to the DirectShapeType. |

# See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace